app/Controllers/Admin/Pembayaran.php

SELECT *
FROM `tagihan`
WHERE `id_tagihan` = '7'
---
    function tampil($id=null){
        $j=$this->db->table('tagihan');
        $j->where(['id_tagihan'=>$id]);
        $d['jenis']=$j->get()->getRow();