app/Controllers/Admin/Tagihan.php

    function form($type='input', $id=null)
    {
        if ($type=='input'){
            $d['title']="Tambah Jenis";
        }elseif ($type=='edit'){
            if (empty($id)){
                return redirect()->back();
            }
            $builder=$this->db->table('tagihan');
            $builder->where(['id_tagihan'=>$id]);
            $data=$builder->get()->getRow();
---
SELECT *
FROM `tagihan`
WHERE `id_tagihan` = '4'

        }else if(!empty($save=='update')){
            $ids=$this->request->getPost('id_tagihan');
            $builder->where('id_tagihan', $ids);
            $up=$builder->update($array);
---
UPDATE `tagihan` SET `tagihan` = 'Hadeuh', `prodi` = 'Manajemen', `semester` = '6', `keterangan` = '$keterangan', `batas_waktu` = '2022-06-23T09:39', `status` = 'Active'
WHERE `id_tagihan` = '4'